from flask import Flask,render_template         # web服务框架
import random
app = Flask(__name__)

hero = ["元流之子(射手)", "空空儿", "苍", "影", "少司缘", "元流之子(坦克)", "元流之子(法师)", "大司命", "敖隐", "海诺", "朵莉亚", "亚连", "姬小满", "莱西奥", "赵怀真", "海月", "戈娅", "桑启", "暃", "金蝉", "云缨", "艾琳", "司空震", "澜", "夏洛特", "阿古朵", "蒙恬", "镜", "蒙犽", "鲁班大师", "西施", "马超", "曜", "云中君", "瑶", "盘古", "猪八戒", "嫦娥", "上官婉儿", "李信", "沈梦溪", "伽罗", "盾山", "司马懿", "孙策", "元歌", "米莱狄", "狂铁", "弈星", "裴擒虎", "杨玉环", "公孙离", "明世隐", "女娲", "梦奇", "苏烈", "百里玄策", "百里守约", "铠", "鬼谷子", "干将莫邪", "东皇太一", "大乔", "黄忠", "诸葛亮", "哪吒", "太乙真人", "蔡文姬", "雅典娜", "杨戬", "钟馗", "虞姬", "李元芳", "张飞", "刘备", "后羿", "牛魔", "孙悟空", "亚瑟", "橘右京", "娜可露露", "不知火舞", "张良", "花木兰", "兰陵王", "王昭君", "韩信", "刘邦", "姜子牙", "露娜", "程咬金", "安琪拉", "貂蝉", "关羽", "老夫子", "武则天", "项羽", "达摩", "狄仁杰", "马可波罗", "李白", "宫本武藏", "典韦", "曹操", "甄姬", "夏侯惇", "周瑜", "吕布", "芈月", "白起", "扁鹊", "孙膑", "钟无艳", "阿轲", "高渐离", "刘禅", "庄周", "鲁班七号", "孙尚香", "嬴政", "妲己", "墨子", "赵云", "小乔", "廉颇"]

@app.route("/index")
def index():
    return render_template("index.html", hero=hero)

@app.route("/choujiang")
def choujiang():
    hero_ran = random.choice(hero)
    return render_template("index.html", hero=hero, hero_cho = hero_ran)

app.run(debug=True)